export interface PeerReview {
  id: number;
  name: string;
  comment: string;
}

export const reviews: PeerReview[] = [
  {
    id: 1,
    name: "프로그래머스 데브코스 1차 프로젝트 팀원 @Clotion",
    comment:
      "팀프로젝트를 이미 여러번 진행해보셨다는 느낌이 들 정도로 이런 저런 이슈 해결이나 진행 속도가 빠르셔서 천군만마를 얻은 기분이었습니다ㅠㅠ ui ux 적 감각도 너무 뛰어나시고 기술 제안이나, 피드백도 빠르시고 정말 다재다능하신 분이었습니다. 소통도 빠르셔서 협업하는데 너무 너무 수월하였습니다. 또 맡은 일 끝까지 책임지려 하는 모습이 정말 멋있었습니다. 완성도 높이려고 계속 노력하시는 모습도 정말 최고 ..",
  },
  {
    id: 2,
    name: "프로그래머스 데브코스 2차 프로젝트 팀원 @POPcon",
    comment:
      "프로젝트 전반에 걸쳐 책임감 있게 맡은 역할을 성실히 수행했으며, 항상 적극적인 참여 태도와 긍정적인 에너지로 팀 분위기를 한층 더 밝고 유쾌하게 만들어주었습니다. 소통도 활발하게 해줘서 팀원 간 협업이 자연스럽고 편안하게 이어질 수 있었고, 맡은 일 외에도 다른 팀원들의 어려움을 함께 나누려는 따뜻한 모습이 인상 깊었습니다. 함께할 수 있어서 든든했고, 정말 고마운 팀원이었습니다.",
  },
  {
    id: 3,
    name: "프로그래머스 데브코스 3차 프로젝트 팀원 @cosmos",
    comment:
      "디자인의 신,, 인터랙티브의 신,, 기술의 신,, 기획하거나 의견 나누는 부분에서도 노션으로 정리해주셔서 덕분에 체계적으로 진행할 수 있었고 프로젝트 뿐만 아니라 ppt 디자인도 도맡아서 끝까지 멋진 퀄리티로 마무리해주셨습니다... 정말 혜주님 덕분에 프로젝트 잘 끝낼 수 있었어요ㅜㅜㅜ 그녀는 완벽합니다",
  },
  {
    id: 4,
    name: "프로그래머스 데브코스 4차 프로젝트 팀원 @이때어때",
    comment:
      "디자인적인 심미안이 정말 탁월하셔서, 프로젝트를 함께하는 내내 감탄했습니다. 제가 대충 시안을 가져와도, 그걸 바탕으로 훨씬 더 완성도 높은 디자인으로 끌어올리는 능력이 인상적이었고, 매번 놀라움을 느꼈습니다. 또한, 디자인뿐 아니라 코드에서도 미적 감각이 느껴졌습니다. 항상 예쁘고 깔끔한 구조를 선호하셔서인지 코드 역시 가독성 좋고 정돈되어 있어, 그 부분에서도 많이 배울 수 있었습니다. 전반적으로 재능이 너무나도 뚜렷하고, 실력도 뛰어나셔서 개인적으로는 정말 탐날 정도였습니다. 더할 나위 없이 완성도 높은 분이라, 지금까지 하신 프로젝트들을 잘 보여주시기만 해도 충분히 좋은 결과로 이어질 거라고 생각합니다.",
  },
  {
    id: 5,
    name: "프로그래머스 데브코스 4차 프로젝트 팀원 @이때어때",
    comment:
      "혜주님은 정말 제가 만나본 사람 중 가장 뛰어난 디자인 감각을 가진 분이에요. 작업물을 볼 때마다 감탄했고, 혜주님 덕분에 우리 프로젝트의 완성도와 퀄리티가 한층 더 높아질 수 있었습니다. 시각적으로 아름다울 뿐 아니라 사용자의 경험까지 세심하게 고려한 디자인 덕분에, 저희가 개발할 때도 훨씬 더 수월했고 만족스러운 결과물을 만들어낼 수 있었어요. 하지만 혜주님은 단순히 실력만 뛰어난 게 아니라, 팀원들의 다양한 의견을 진심으로 경청하고 수용하려는 태도까지 갖추고 있어서 더 멋졌어요. 본인의 스타일이 있음에도 늘 유연하고 겸손하게 팀원들과 소통하는 모습이 정말 인상 깊었고, 저도 그런 혜주님의 태도에서 많은 것을 배울 수 있었습니다. 또 팀 전체 분위기를 편안하고 즐겁게 만들어주는 모습도 좋았습니다. 혜주님 덕분에 팀원 모두가 즐겁고 편안한 분위기 속에서 작업할 수 있었고, 함께하는 시간이 늘 행복했습니다.",
  },
  {
    id: 6,
    name: "프로그래머스 데브코스 4차 프로젝트 팀원 @이때어때",
    comment:
      "프로젝트 내내 보여지는 모든 부분(발표 자료, 캐릭터, UI 등)에서 워낙 뛰어난 역량이 돋보이셔서, 그런 작업들을 거의 전부 도맡아 진행하시느라 정말 고생 많으셨을 것 같습니다. 하나라도 대충 넘기지 못하시는 성향 덕분에 모든 결과물이 완성도 높고 완벽하게 느껴졌어요.그만큼 몸도 마음도 많이 힘드셨을 것 같아서, 진심으로 감사하다는 말씀을 꼭 전하고 싶습니다.",
  },
  {
    id: 7,
    name: "프로그래머스 데브코스 3차 프로젝트 팀원 @cosmos",
    comment:
      "디자인부터 기능 구현까지 못하는게 없으십니다. 특히 디자인이 너무 예뻐서 구현할때 즐겁게 작업할 수 있었고, 꼼꼼하게 작업하시고 하는 모습 덕분에 전체적인 완성도가 높아졌다 생각합니다. 저희 샤이니팀에서 ㅋㅋㅋ만능열쇠 키 역할이셨습니다!",
  },
  {
    id: 8,
    name: "프로그래머스 데브코스 2차 프로젝트 팀원 @POPcon",
    comment:
      "같은 팀원으로 2차 프로젝트를 함께할 수 있어 정말 좋았고, 항상 팀원과 팀장을 도우려는 모습이 너무 고마웠습니다. 솔직히 혜주님이 없었다면 프로젝트가 이만큼까지 완성되긴 어려웠을 거라 생각해요. 정말 많은 부분을 완벽하게 해냈고, 특히 저와 함께 새벽까지 남아서 묵묵히 작업해준 그 시간들이 지금도 기억에 남습니다. 돌아보면 제가 너무 많은 역할을 부탁드렸던 건 아닐까 하는 미안한 마음도 있습니다. 그럼에도 늘 성실하게, 그리고 말없이 책임져준 모습에 진심으로 감사했습니다. 함께해서 든든했고, 책임감 강하고 모두를 배려하는 좋은 개발자 동료, 그리고 현혜주라는 멋진 사람을 만나서 정말 행복했습니다.",
  },
  {
    id: 9,
    name: "프로그래머스 데브코스 1차 프로젝트 팀원 @Clotion",
    comment: "프로젝트하면서 아이디어가 되게 많고 좋았어요!! 디자인도 최고",
  },
  {
    id: 10,
    name: "프로그래머스 데브코스 2차 프로젝트 팀원 @POPcon",
    comment:
      "디자인.. 진짜 손도 많이 가고 신경 쓸 것도 많은 분야인데 너무너무 잘하십니다..!! 멋져용 기능 개발이나 퍼블리싱 등의 부분도 실력이 좋으시고, 배울 점이 많은 팀원분이었습니다",
  },
  {
    id: 11,
    name: "프로그래머스 데브코스 2차 프로젝트 팀원 @cosmos",
    comment:
      "디자인이나 기능적으로 전부 잘하시고 적극적으로 일을 주도하시는 모습이 좋았습니다.",
  },
  {
    id: 12,
    name: "프로그래머스 데브코스 4차 프로젝트 팀원 @이때어때",
    comment:
      "이번에 처음으로 프로젝트하면서 디자인 진짜 많이 배우고 갑니다. 직접적으로 수업을 들은 건 아니지만 이렇게 같이 프로젝트를 하면서 디자인을 옆에서 보는 것 만으로도 엄청난 도움이 되었습니다. 그리고 많이 부족하지만 잘한다고 해주면서 프로젝트 잘 마무리할 수 있게 도와주셔서 감사합니다!!!!! 참 많이 답답했을 텐데 싫은 내색 안하고 즐겁게 마무리할 수 있어서 좋았습니다 희희 이제 혜주님 놓치지 않을거에요",
  },
  {
    id: 13,
    name: "프로그래머스 데브코스 4차 프로젝트 팀원 @이때어때",
    comment:
      "혜주님에게는 고마운 마음을 어떻게 다 말로 표현할 수 있을지 모르겠습니다. 이번 파이널 프로젝트를 함께 하면서 정말 많은 걸 느꼈고, 특히 혜주님과 함께해서 더 즐겁고 든든한 시간이었습니다. 작업을 하면서 정신적으로든, 실력적인 부분에서든 정말 많은 의지를 했고 도움도 많이 받았어요. 늦은 시간까지도 늘 함께 작업해주고, 그 와중에도 늘 웃으며 즐겁게 분위기를 이끌어주는 혜주님 덕분에 힘든 순간도 오히려 좋은 추억으로 남을 수 있었어요. 단순히 실력만 뛰어난 게 아니라, 함께하는 사람들을 기분 좋게 만드는 재능이 있는 사람이란 걸 정말 매 순간 느꼈습니다. 혜주님이 가진 태도나 작업에 임하는 자세, 세심한 배려, 팀원에 대한 존중, 그리고 무너지지 않고 끈기있게 끝까지 밀고 나가는 집중력 모두 정말 멋졌고, 저 역시 그런 모습들을 보며 많은 동기부여를 받았어요. 어떤 상황에서도 흔들리지 않고 자기 역할을 해내는 모습은 정말 본받고 싶고, 앞으로 제가 개발자로 성장해 나가면서도 계속 기억에 남을 거예요. 무엇보다도 혜주님과 함께라서 이 프로젝트가 정말 더 소중하게 느껴졌습니다. 결과물도, 과정도, 그리고 그 모든 순간의 분위기까지 너무 좋았어요. 함께할 수 있어서 진심으로 행복했고, 진심으로 고마워요. 혜주님은 가진 장점이 정말 많고, 여기에 노력을 더할 줄 아는 사람이기 때문에 앞으로 분명 어디에서든 멋진 개발자가 될 거라 믿어요.앞으로의 모든 길을 응원할게요.",
  },
];
